Autodesk.Revit.DB.Structure.RebarShapeConstraintCircumference.ArcReferenceType
The choice of rule for measuring the diameter.
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeConstraintCircumference.#ctor(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.RebarShapeArcReferenceType)
Create a circumference constraint.
paramId:
The Id of a Rebar Shape parameter.
refType:
A choice of rule for measuring the circumference.
Throws Autodesk.Revit.Exceptions.ArgumentException:
paramId is not a valid Element identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeConstraintCircumference
A circumference constraint associated with an arc in a RebarShapeDefinition.
Since:
2012